---
kind: method
id: M:Autodesk.Revit.DB.DocumentSet.GetEnumerator
source: html/4738f157-c89f-492f-8c97-d881003a4851.htm
---
# Autodesk.Revit.DB.DocumentSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.